{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "input_2:0": {"name": "input_2:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "470"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_model/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/recommender_model/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_model/dot/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5000"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_model/embedding_1/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/recommender_model/flatten_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_model/dot/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/recommender_model/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "input_1", "StatefulPartitionedCall/recommender_model/embedding/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_model/embedding_1/embedding_lookup", "op": "GatherV2", "input": ["unknown_0", "input_2", "StatefulPartitionedCall/recommender_model/embedding_1/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_model/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/recommender_model/embedding/embedding_lookup", "StatefulPartitionedCall/recommender_model/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_model/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/recommender_model/embedding_1/embedding_lookup", "StatefulPartitionedCall/recommender_model/flatten_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_model/dot/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/recommender_model/flatten/Reshape", "StatefulPartitionedCall/recommender_model/dot/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_model/dot/ExpandDims_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/recommender_model/flatten_1/Reshape", "StatefulPartitionedCall/recommender_model/dot/ExpandDims_1/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_model/dot/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/recommender_model/dot/ExpandDims", "StatefulPartitionedCall/recommender_model/dot/ExpandDims_1"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/recommender_model/dot/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/recommender_model/dot/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/recommender_model/dot/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [470, 50], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_model/embedding/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_model/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_model/dot/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "unknown_0", "shape": [5000, 50], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_model/embedding_1/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_model/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_model/dot/ExpandDims_1/dim", "shape": [], "dtype": "int32"}]}]}