{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"embedding_Embedding1","class_name":"Embedding","config":{"input_dim":324,"output_dim":50,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"embedding_Embedding1","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"embedding_Embedding2","class_name":"Embedding","config":{"input_dim":4049,"output_dim":50,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"embedding_Embedding2","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["embedding_Embedding1",0,0,{}]]]},{"name":"flatten_Flatten2","class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true},"inbound_nodes":[[["embedding_Embedding2",0,0,{}]]]},{"name":"dot_Dot1","class_name":"Dot","config":{"axes":1,"normalize":false,"name":"dot_Dot1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}],["flatten_Flatten2",0,0,{}]]]}],"input_layers":[["input1",0,0],["input2",0,0]],"output_layers":[["dot_Dot1",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./my-model.weights.bin"],"weights":[{"name":"embedding_Embedding1/embeddings","shape":[324,50],"dtype":"float32"},{"name":"embedding_Embedding2/embeddings","shape":[4049,50],"dtype":"float32"}]}]}